# Задание №5
# Напишите программу, которая решает квадратные уравнения даже если дискриминант отрицательный.
# Используйте комплексные числа для извлечения квадратного корня.

# a = int(input('Введите a: '))
# b = int(input('Введите b: '))
# c = int(input('Введите c: '))

a, b, c = 1, -6, 13

d = b * b - 4 * a * c

if d >= 0:
    x1 = (-b + d ** 0.5) / 2 / a
    x2 = (-b - d ** 0.5) / 2 / a
else:
    x1 = (-b + complex(d) ** 0.5) / 2 / a
    x2 = (-b - complex(d) ** 0.5) / 2 / a

print(f'{x1=}')
print(f'{x2=}')
