# Задание №2
# Пользователь вводит данные. Сделайте проверку данных и преобразуйте если возможно в один из вариантов ниже:
# Целое положительное число
# Вещественное положительное или отрицательное число
# Строку в нижнем регистре, если в строке есть хотя бы одна заглавная буква
# Строку в нижнем регистре в остальных случаях

# не стал решать
while True:
    data = input('Введите данные (или q для выхода): ')

    if data == 'q':
        break
    else:
        print(f'Просто строка в нижнем регистре: {str(data).lower()}')
